<a href="https://colab.research.google.com/github/vitor-edu/Programa-de-Formacao-Big-Data-BRQ/blob/main/Arvore_de_decisao_exercicios.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Para testar o nosso algoritmo vamos utilizar a base de dados Iris. 
# Importando as bibliotecas. 
import pandas as pd 
from sklearn import tree 
from sklearn.model_selection import train_test_split 
import sklearn.metrics as metrics
import graphviz

In [2]:
from google.colab import files # Fazendo upload do arquivo
uploaded = files.upload()

Saving titanic_data.csv to titanic_data.csv

In [5]:
base = pd.read_csv('titanic_data.csv') # Função read lendo arquivos. 
base

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [6]:
base.head(5) # Comando read retorna a quantidade de linhas passada como parâmetro.

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [8]:
base.shape # Função shape retorna quantidades de linhas e colunas.

(891, 12)

In [9]:
base.dtypes # Função dtypes retorna tipos de dados de cada coluna.

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
base.isnull().sum() #  A função  isnull() retorna True caso encontre valores do tipo NaN ou Nulo, utlizei a função sum pra somar os valores faltantes, de cada coluna.

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:
base.columns # Função retorna os nomes das colunas.

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [31]:
new_base = base.drop(columns=["PassengerId"]) # Excluindo a coluna passada por parâmetro.

In [32]:
new_base

     Survived  Pclass  ... Cabin Embarked
0           0       3  ...   NaN        S
1           1       1  ...   C85        C
2           1       3  ...   NaN        S
3           1       1  ...  C123        S
4           0       3  ...   NaN        S
..        ...     ...  ...   ...      ...
886         0       2  ...   NaN        S
887         1       1  ...   B42        S
888         0       3  ...   NaN        S
889         1       1  ...  C148        C
890         0       3  ...   NaN        Q

[891 rows x 11 columns]

In [33]:
new_base = new_base.drop(columns=["Cabin"]) # Excluindo a coluna passada por parâmetro.

In [34]:
new_base

     Survived  Pclass  ...     Fare Embarked
0           0       3  ...   7.2500        S
1           1       1  ...  71.2833        C
2           1       3  ...   7.9250        S
3           1       1  ...  53.1000        S
4           0       3  ...   8.0500        S
..        ...     ...  ...      ...      ...
886         0       2  ...  13.0000        S
887         1       1  ...  30.0000        S
888         0       3  ...  23.4500        S
889         1       1  ...  30.0000        C
890         0       3  ...   7.7500        Q

[891 rows x 10 columns]

In [35]:
new_base = new_base.drop(columns=["SibSp"]) # Excluindo a coluna passada por parâmetro.

In [36]:
new_base

     Survived  Pclass  ...     Fare Embarked
0           0       3  ...   7.2500        S
1           1       1  ...  71.2833        C
2           1       3  ...   7.9250        S
3           1       1  ...  53.1000        S
4           0       3  ...   8.0500        S
..        ...     ...  ...      ...      ...
886         0       2  ...  13.0000        S
887         1       1  ...  30.0000        S
888         0       3  ...  23.4500        S
889         1       1  ...  30.0000        C
890         0       3  ...   7.7500        Q

[891 rows x 9 columns]

In [37]:
new_base = new_base.drop(columns=["Parch"]) # Excluindo a coluna passada por parâmetro.

In [38]:
new_base

     Survived  Pclass  ...     Fare Embarked
0           0       3  ...   7.2500        S
1           1       1  ...  71.2833        C
2           1       3  ...   7.9250        S
3           1       1  ...  53.1000        S
4           0       3  ...   8.0500        S
..        ...     ...  ...      ...      ...
886         0       2  ...  13.0000        S
887         1       1  ...  30.0000        S
888         0       3  ...  23.4500        S
889         1       1  ...  30.0000        C
890         0       3  ...   7.7500        Q

[891 rows x 8 columns]

In [39]:
new_base = new_base.drop(columns=["Ticket"]) # Excluindo a coluna passada por parâmetro.

In [40]:
new_base

     Survived  Pclass  ...     Fare Embarked
0           0       3  ...   7.2500        S
1           1       1  ...  71.2833        C
2           1       3  ...   7.9250        S
3           1       1  ...  53.1000        S
4           0       3  ...   8.0500        S
..        ...     ...  ...      ...      ...
886         0       2  ...  13.0000        S
887         1       1  ...  30.0000        S
888         0       3  ...  23.4500        S
889         1       1  ...  30.0000        C
890         0       3  ...   7.7500        Q

[891 rows x 7 columns]

In [41]:
new_base = new_base.drop(columns=["Embarked"]) # Excluindo a coluna passada por parâmetro.

In [42]:
new_base

     Survived  Pclass  ...   Age     Fare
0           0       3  ...  22.0   7.2500
1           1       1  ...  38.0  71.2833
2           1       3  ...  26.0   7.9250
3           1       1  ...  35.0  53.1000
4           0       3  ...  35.0   8.0500
..        ...     ...  ...   ...      ...
886         0       2  ...  27.0  13.0000
887         1       1  ...  19.0  30.0000
888         0       3  ...   NaN  23.4500
889         1       1  ...  26.0  30.0000
890         0       3  ...  32.0   7.7500

[891 rows x 6 columns]

In [43]:
new_base.isnull().sum() #  A função  isnull() retorna True caso encontre valores do tipo NaN ou Nulo, utlizei a função sum pra somar os valores faltantes, de cada coluna.

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
Fare          0
dtype: int64

In [44]:
new_base.isna().sum() # Função isna retorna a quantidade de campos vazios.

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
Fare          0
dtype: int64

In [52]:
new_base.fillna(new_base.mean()) # Subistituindo os campos da coluna contendo 'NaN', pela média.

     Survived  Pclass  ...        Age     Fare
0           0       3  ...  22.000000   7.2500
1           1       1  ...  38.000000  71.2833
2           1       3  ...  26.000000   7.9250
3           1       1  ...  35.000000  53.1000
4           0       3  ...  35.000000   8.0500
..        ...     ...  ...        ...      ...
886         0       2  ...  27.000000  13.0000
887         1       1  ...  19.000000  30.0000
888         0       3  ...  29.699118  23.4500
889         1       1  ...  26.000000  30.0000
890         0       3  ...  32.000000   7.7500

[891 rows x 6 columns]

In [58]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(Survived, test_size=0.25)

#X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.33, random_state=42)

NameError: ignored